In [1]:
import psycopg2
import pandas as pd

In [2]:
def create_database():
    
    try:
        conn = psycopg2.connect('host = localhost dbname = postgres user=postgres password = naijil')
        conn.set_session(autocommit=True)
        cur = conn.cursor()
    
        cur.execute('DROP DATABASE IF EXISTS carsdatabase')                    
        cur.execute('CREATE DATABASE carsdatabase')

        conn.close()
                        
        conn = psycopg2.connect('host = localhost dbname = carsdatabase user=postgres password = naijil')
        cur = conn.cursor()
                        
        return cur, conn

    except psycopg2.OperationalError as e:
        print("Error:", e)

In [3]:
def drop_tables(cur, conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [4]:
def create_tables(cur, conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [5]:
carsdetails=pd.read_csv('cars_multi.csv')

In [6]:
carsdetails['horsepower'] = carsdetails['horsepower'].replace('?', 0)

In [7]:
carsdetails.head()

,ID,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car_name
0,1,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,2,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,3,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,4,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,5,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [8]:
carscountry=pd.read_csv('cars_country.csv')

In [9]:
carscountry

   origin country
0       1     USA
1       2  Europe
2       3   Japan

In [20]:
carsprice=pd.read_csv('cars_price.csv')

In [21]:
carsprice.head()

   ID        price
0   1  25561.59078
1   2  24221.42273
2   3  27240.84373
3   4  33684.96888
4   5  20000.00000

In [22]:
carsprice['price'] = carsprice['price'].round(2)

In [23]:
carsprice.head()

   ID     price
0   1  25561.59
1   2  24221.42
2   3  27240.84
3   4  33684.97
4   5  20000.00

In [24]:
cur, conn = create_database()

In [25]:
cdetails_table_create = ("""CREATE TABLE carsdetails(
id INT PRIMARY KEY,
mpg INT,
cylinders INT,
displacement INT,
horsepower INT,
weight INT,
acceleratiion INT,
model INT,
origin INT,
car_name VARCHAR)""")

In [26]:
cur.execute(cdetails_table_create)
conn.commit()

In [27]:
ccountry_table_create = ("""CREATE TABLE carscountry(
origin INT,
country VARCHAR
)""")

In [28]:
cur.execute(ccountry_table_create)
conn.commit()

In [29]:
cprice_table_create = ("""CREATE TABLE carsprice(
id INT,
price INT
)""")

In [30]:
cur.execute(cprice_table_create)
conn.commit()

In [31]:
carsdetails_table_insert = ("""INSERT INTO carsdetails(
id,
mpg,
cylinders,
displacement,
horsepower,
weight,
acceleratiion,
model,
origin,
car_name)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
""")

In [32]:
for i, row in carsdetails.iterrows():
    cur.execute(carsdetails_table_insert, list(row))

In [33]:
conn.commit()

In [34]:
carscountry_table_insert = ("""INSERT INTO carscountry(
origin,
country)
VALUES (%s, %s)
""")

In [35]:
for i, row in carscountry.iterrows():
    cur.execute(carscountry_table_insert, list(row))
    
conn.commit()

In [36]:
carsprice_table_insert = ("""INSERT INTO carsprice(
id,
price)
VALUES (%s, %s)
""")

In [37]:
for i, row in carsprice.iterrows():
    cur.execute(carsprice_table_insert, list(row))
    
conn.commit()